DataProcessors/МенеджерИнтеграцииСРекрутинговымиСайтами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>МенеджерИнтеграцииСРекрутинговымиСайтами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МенеджерыСайтов</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСайтов</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/МенеджерИнтеграцииСРекрутинговымиСайтами/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
//  ФиксированноеСоответствие Из КлючИЗначение:
//  * Ключ - СправочникСсылка.ИсточникиИнформацииОКандидатах
//  * Значение - Структура: См. РекрутинговыеСайтыСлужебный.НовыеДанныеСайта
Функция ДанныеСайтов() Экспорт
	
	Если ДанныеСайтов = Неопределено Тогда
		НовыеДанныеСайтов = Новый Соответствие();
		
		Для Каждого Сайт Из Сайты Цикл
			НовыеДанныеСайтов.Вставить(Сайт, РекрутинговыеСайтыВнутренний.ДанныеСайта(Сайт));
		КонецЦикла;
		
		ДанныеСайтов = Новый ФиксированноеСоответствие(НовыеДанныеСайтов);
	КонецЕсли;
	
	Возврат ДанныеСайтов;
	
КонецФункции

// Возвращаемое значение:
//  ФиксированныйМассив Из СправочникСсылка.ИсточникиИнформацииОКандидатах
Функция Сайты() Экспорт
	
	Если Сайты = Неопределено Тогда
		Сайты = РекрутинговыеСайты.ИспользуемыеСайты();
	КонецЕсли;
	
	Возврат Сайты;
	
КонецФункции

Функция ПроверитьПодключение() Экспорт
	
	Результат = Новый Соответствие();
	
	Для Каждого Сайт Из Сайты Цикл
		Попытка
			РезультатПроверкиПодключения =
				РекрутинговыеСайтыВнутренний.ПроверитьПодключение(Сайт, МенеджерыСайтов[Сайт]);
			Результат.Вставить(Сайт, РезультатПроверкиПодключения);
		Исключение
			Описание = СтрШаблон(
				НСтр("ru = 'Ошибка при проверке подключения к сайту %1:
				|%2'"), Сайт, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Проверка подключения к рекрутинговому сайту'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,
				Описание);
		КонецПопытки;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Подключить(ПараметрыПодключения) Экспорт
	
	Сайт = ПараметрыПодключения.Сайт;
	
	Результат = РекрутинговыеСайтыВнутренний.Подключить(Сайт, МенеджерыСайтов[Сайт], ПараметрыПодключения);
	
	Если Результат.Подключен Тогда
		Результат.Пользователь = Пользователь;
		Результат.Сайт = ПараметрыПодключения.Сайт;
		РекрутинговыеСайтыСлужебный.СохранитьНастройкиАвторизации(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьКлассификаторы() Экспорт
	
	Классификаторы = Новый Соответствие();
	
	Для Каждого Сайт Из Сайты Цикл
		Классификаторы.Вставить(
			Сайт, РекрутинговыеСайтыВнутренний.ЗагрузитьКлассификаторы(Сайт, МенеджерыСайтов[Сайт]));
	КонецЦикла;
	
	Возврат Классификаторы;
	
КонецФункции

Функция НайтиКандидатов(Параметры) Экспорт
	
	Результат = Параметры;
	
	СтруктураОтбора = Параметры.СтруктураОтбора;
	ТаблицаНайденныхКандидатов = Параметры.ТаблицаНайденныхКандидатов;
	ПолеСортировки = 0;
	
	ДанныеСайтов = ДанныеСайтов();
	
	ПерваяПорция = Истина;
	Для Каждого Сайт Из Сайты Цикл
		Если Параметры[ИмяРеквизита(ДанныеСайтов, "НомерПорции", Сайт)] <> 0 Тогда
			ПерваяПорция = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПерваяПорция Тогда
		ТаблицаНайденныхКандидатов.Очистить();
	Иначе
		ПолеСортировки = ТаблицаНайденныхКандидатов[ТаблицаНайденныхКандидатов.Количество() - 1].ПолеСортировки + 1;
	КонецЕсли;
	
	Для Каждого Сайт Из Сайты Цикл
		Если Не ДанныеСайтов[Сайт].ДоступенПоискРезюме Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаНайденныхКандидатовСайта = ТаблицаНайденныхКандидатов.СкопироватьКолонки();
		ВсегоКандидатовСайта = Параметры[ИмяРеквизита(ДанныеСайтов, "ВсегоКандидатов", Сайт)];
		НомерПорции = Параметры[ИмяРеквизита(ДанныеСайтов, "НомерПорции", Сайт)];
		
		Если ВсегоКандидатовСайта > 0 
			И ВсегоКандидатовСайта = Параметры[ИмяРеквизита(ДанныеСайтов, "ЗагруженоКандидатов", Сайт)] Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыПоиска = РекрутинговыеСайтыСлужебный.НовыеПараметрыПоиска();
		ПараметрыПоиска.НомерСтраницы = НомерПорции;
		ПараметрыПоиска.ПолеСортировки = ПолеСортировки;
		ПараметрыПоиска.ВсегоКандидатов = ВсегоКандидатовСайта;
		
		РекрутинговыеСайтыВнутренний.НайтиКандидатов(
			Сайт, МенеджерыСайтов[Сайт], ТаблицаНайденныхКандидатовСайта, СтруктураОтбора, ПараметрыПоиска);
			
		Для Каждого СтрокаТаблицы Из ТаблицаНайденныхКандидатовСайта Цикл
			НоваяСтрока = ТаблицаНайденныхКандидатов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		КонецЦикла;
		
		Результат.Вставить(ИмяРеквизита(ДанныеСайтов, "ВсегоКандидатов", Сайт), ПараметрыПоиска.ВсегоКандидатов);
		Результат.Вставить(ИмяРеквизита(ДанныеСайтов, "НомерПорции", Сайт), 
			?(ТаблицаНайденныхКандидатовСайта.Количество() > 0, НомерПорции + 1, НомерПорции));
		Результат.Вставить(ИмяРеквизита(ДанныеСайтов, "ЗагруженоКандидатов", Сайт), 
			ТаблицаНайденныхКандидатовСайта.Количество());
	КонецЦикла;
	
	ТаблицаНайденныхКандидатов.Сортировать("ПолеСортировки");
	
	Результат.Вставить("ТаблицаНайденныхКандидатов", ТаблицаНайденныхКандидатов);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеРезюмеПоАдресу(АдресРезюме) Экспорт
	
	Сайт = СайтПоАдресуРезюме(АдресРезюме);
	
	ИдентификаторРезюме = ИдентификаторРезюмеПоАдресу(Сайт, АдресРезюме);
	
	Возврат Новый Структура("Сайт, ИдентификаторРезюме", Сайт, ИдентификаторРезюме);
	
КонецФункции

Функция ДанныеКандидатаССайта(ИдентификаторРезюме) Экспорт

	ДанныеКандидата = Неопределено;
	
	Для Каждого Сайт Из Сайты Цикл
		ДанныеКандидата = РекрутинговыеСайтыВнутренний.ДанныеКандидатаПоРезюмеССайта(
			Сайт, МенеджерыСайтов[Сайт], ИдентификаторРезюме);
	КонецЦикла;
	
	Возврат ДанныеКандидата;
	
КонецФункции

Функция СайтПоАдресуРезюме(АдресРезюме) Экспорт

	Результат = Неопределено;
	
	Для Каждого Сайт Из Сайты Цикл
		Если РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(АдресРезюме, ДанныеСайтов[Сайт].ИмяСайта) <> 0 Тогда
			Результат = Сайт;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
			СтрШаблон(НСтр("ru = 'Неизвестный рекрутинговый сайт в адресе %1'"), АдресРезюме));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбъединенныйСписокВыбораПоКлассификаторам(ИмяСписка) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	ИменаСписковВыбора = РекрутинговыеСайтыСлужебный.ИменаСписковВыбора();
	ПредставлениеСписка = "";
	Если ИмяСписка = ИменаСписковВыбора.Пол Тогда
		ПредставлениеСписка = "gender";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.УровеньОбразования Тогда
		ПредставлениеСписка = "education_level";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.ПериодРазмещения Тогда
		ПредставлениеСписка = "periods";
	Иначе
		Возврат СписокВыбора;
	КонецЕсли;
	
	КлассификаторыОбщие = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("КлассификаторыОбщие");
	
	Для Каждого ЭлементПоиска Из КлассификаторыОбщие[ПредставлениеСписка] Цикл
		
		Идентификаторы = Новый Структура();
		
		Для Каждого Сайт Из Сайты Цикл
			ДанныеСайта = ДанныеСайтов[Сайт];
			
			ЭлементКлассификатора = РекрутинговыеСайтыВнутренний.ЭлементКлассификатора(
					Сайт, МенеджерыСайтов[Сайт], ИмяСписка, ЭлементПоиска.Значение);
			
			Если ЗначениеЗаполнено(ЭлементКлассификатора) Тогда
				Идентификаторы.Вставить(ИдентификаторЗначенияКлассификатора(ДанныеСайта.Имя), ЭлементКлассификатора);
			КонецЕсли;
		КонецЦикла;
		
		СписокВыбора.Добавить(Идентификаторы, ЭлементПоиска.Значение);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

Функция ИнформацияОПользователе(Сайт) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НоваяИнформацияОПользователе();
	
	Если МенеджерыСайтов[Сайт] <> Неопределено Тогда
		Результат =  РекрутинговыеСайтыВнутренний.ИнформацияОПользователе(Сайт, МенеджерыСайтов[Сайт]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеПерсональногоМенеджера(Сайт) Экспорт
	
	ИнформацияОПользователе = ИнформацияОПользователе(Сайт);
	
	Возврат ИнформацияОПользователе.ПерсональныйМенеджер;
	
КонецФункции

Функция ПоискДоступен(Сайт) Экспорт
	
	ПоискДоступен = Неопределено;
	
	Если МенеджерыСайтов[Сайт] <> Неопределено Тогда
		ПоискДоступен =  РекрутинговыеСайтыВнутренний.ПоискДоступен(Сайт, МенеджерыСайтов[Сайт]);
	КонецЕсли;
	
	Возврат ПоискДоступен;
	
КонецФункции

Функция ВакансииССайта(Сайт, БылиОшибки) Экспорт
	
	Если МенеджерыСайтов[Сайт] = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат РекрутинговыеСайтыВнутренний.ВакансииССайта(Сайт, МенеджерыСайтов[Сайт], БылиОшибки);
	КонецЕсли;
	
КонецФункции

Функция ЗначениеРеквизитаПубликацииПоУмолчанию(Сайт, Вакансия, Реквизит) Экспорт
	
	Результат = Неопределено;
	
	Если Реквизит = "Ответственный" Тогда
		Возврат Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Если МенеджерыСайтов[Сайт] <> Неопределено Тогда
			Результат = РекрутинговыеСайтыВнутренний.ЗначениеРеквизитаПубликацииПоУмолчанию(
				Сайт, МенеджерыСайтов[Сайт], Вакансия, Реквизит);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		МетаданныеРеквизита = Метаданные.Справочники.Вакансии.Реквизиты.Найти(Реквизит);
		Если МетаданныеРеквизита <> Неопределено Тогда
			Если ЗначениеЗаполнено(МетаданныеРеквизита.ЗначениеЗаполнения) Тогда
				Возврат МетаданныеРеквизита.ЗначениеЗаполнения;
			КонецЕсли;
			Возврат МетаданныеРеквизита.Тип.ПривестиЗначение();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДеревоПубликацииВакансии(Сайт, Вакансии, Вакансия, ИдентификаторВакансии) Экспорт
	
	Дерево = РекрутинговыеСайтыСлужебный.НовоеДеревоПубликацииВакансии();
	
	СтруктураВакансииССайта = Неопределено;
	
	Для Каждого ЭлементМассиваВакансий Из Вакансии Цикл
		Если Формат(РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла(ЭлементМассиваВакансий, "id"), "ЧГ=0") = ИдентификаторВакансии Тогда
			СтруктураВакансииССайта = ЭлементМассиваВакансий;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураВакансииССайта <> Неопределено И МенеджерыСайтов[Сайт] <> Неопределено Тогда
		РекрутинговыеСайтыВнутренний.ЗаполнитьДеревоВакансии(
			Сайт, МенеджерыСайтов[Сайт], Вакансия, Дерево, СтруктураВакансииССайта);
	КонецЕсли;
	
	Возврат Дерево;
	
КонецФункции

Функция ПоляВакансии(Сайт, ОбновлениеПубликации, ПовторнаяПубликация) Экспорт
	
	Если МенеджерыСайтов[Сайт] = Неопределено Тогда
		Возврат Новый Массив();
	Иначе
		Возврат РекрутинговыеСайтыВнутренний.ПоляВакансии(
			Сайт, МенеджерыСайтов[Сайт], ОбновлениеПубликации, ПовторнаяПубликация);
	КонецЕсли;
	
КонецФункции

Функция АдресВакансии(Сайт, ИдентификаторВакансии) Экспорт
	
	Если МенеджерыСайтов[Сайт] = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат РекрутинговыеСайтыВнутренний.АдресВакансии(Сайт, МенеджерыСайтов[Сайт], ИдентификаторВакансии);
	КонецЕсли;
	
КонецФункции

Функция ВидыПолей(Сайт, ОбновлениеПубликации = Ложь) Экспорт
	
	Если МенеджерыСайтов[Сайт] = Неопределено Тогда
		Возврат РекрутинговыеСайтыСлужебный.НовыеВидыПолей();
	Иначе
		Возврат РекрутинговыеСайтыВнутренний.ВидыПолей(Сайт, МенеджерыСайтов[Сайт], ОбновлениеПубликации);
	КонецЕсли;
	
КонецФункции

Функция СписокВыбораПоКлассификатору(Сайт, Путь) Экспорт
	
	Если МенеджерыСайтов[Сайт] = Неопределено Тогда
		Возврат Новый СписокЗначений();
	Иначе
		Возврат РекрутинговыеСайтыВнутренний.СписокВыбораПоКлассификатору(Сайт, МенеджерыСайтов[Сайт], Путь);
	КонецЕсли;
	
КонецФункции

Функция ОпубликоватьВакансию(Сайт, Дерево) Экспорт
	
	Если МенеджерыСайтов[Сайт] = Неопределено Тогда
		Возврат РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	Иначе
		Возврат РекрутинговыеСайтыВнутренний.ОпубликоватьВакансию(Сайт, МенеджерыСайтов[Сайт], Дерево);
	КонецЕсли;
	
КонецФункции

Функция ПрименитьТарифКВакансии(Сайт, Идентификатор, Тариф) Экспорт
	
	Если МенеджерыСайтов[Сайт] = Неопределено Тогда
		Возврат РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	Иначе
		Возврат РекрутинговыеСайтыВнутренний.ПрименитьТарифКВакансии(Сайт, МенеджерыСайтов[Сайт], Идентификатор, Тариф);
	КонецЕсли;
	
КонецФункции

Функция ПовторноОпубликоватьВакансию(Сайт, Дерево, Вакансия, ИдентификаторВакансии = Неопределено) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	ДанныеСайта = ДанныеСайтов[Сайт]; // См. РекрутинговыеСайтыСлужебный.НовыеДанныеСайта
	
	Если МенеджерыСайтов[Сайт] <> Неопределено И ДанныеСайта.ДоступнаПовторнаяПубликацияВакансий Тогда
		Если Не ЗначениеЗаполнено(ИдентификаторВакансии) Тогда
			ИдентификаторВакансии = РекрутинговыеСайтыСлужебный.ИдентификаторВакансии(Вакансия, Сайт);
		КонецЕсли;
		
		Результат = РекрутинговыеСайтыВнутренний.ПовторноОпубликоватьВакансию(
			Сайт, МенеджерыСайтов[Сайт], Дерево, Вакансия, ИдентификаторВакансии);
	Иначе
		Результат.Успешно = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьПубликациюВакансии(Сайт, Дерево, ИдентификаторВакансии) Экспорт
	
	Если МенеджерыСайтов[Сайт] = Неопределено Тогда
		Возврат РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	Иначе
		Возврат РекрутинговыеСайтыВнутренний.ОбновитьПубликациюВакансии(
			Сайт, МенеджерыСайтов[Сайт], Дерево, ИдентификаторВакансии);
	КонецЕсли;
	
КонецФункции

Функция СнятьПубликациюВакансии(Сайт, ИдентификаторВакансии) Экспорт
	
	Если МенеджерыСайтов[Сайт] = Неопределено Тогда
		Возврат РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	Иначе
		Возврат РекрутинговыеСайтыВнутренний.СнятьПубликациюВакансии(
			Сайт, МенеджерыСайтов[Сайт], ИдентификаторВакансии);
	КонецЕсли;
	
КонецФункции

Функция СвойстваПубликацииВакансииНаСайте(Сайт, ИдентификаторВакансии) Экспорт
	
	Если МенеджерыСайтов[Сайт] = Неопределено Тогда
		Возврат РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
	Иначе
		Возврат РекрутинговыеСайтыВнутренний.СвойстваПубликацииВакансииНаСайте(
			Сайт, МенеджерыСайтов[Сайт], ИдентификаторВакансии);
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьОтклики(Сайт, Вакансия) Экспорт
	
	Если МенеджерыСайтов[Сайт] <> Неопределено Тогда
		РекрутинговыеСайтыВнутренний.ПолучитьОтклики(Сайт, МенеджерыСайтов[Сайт], Вакансия);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьКомментарииКандидата(Кандидат, ДанныеРезюме) Экспорт
	
	Для Каждого Сайт Из Сайты Цикл
		Если ДанныеСайтов[Сайт].ДоступнаЗагрузкаКомментариевКандидатов Тогда
			РекрутинговыеСайтыВнутренний.ЗагрузитьКомментарииКандидата(Сайт, МенеджерыСайтов[Сайт], Кандидат, ДанныеРезюме);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоКлассификатора(Классификатор, Дерево) Экспорт
	
	Заполнено = Ложь;
	
	Если Сайты.Количество() > 1 И Классификатор = "areas_towns" Тогда
		ЗаполнитьОбъединенноеДеревоРегионов(Дерево, Классификатор);
		Заполнено = Истина;
	КонецЕсли;
	
	Для Каждого Сайт Из Сайты Цикл
		Если Заполнено Тогда
			Возврат;
		КонецЕсли;
		
		Заполнено = РекрутинговыеСайтыВнутренний.ЗаполнитьДеревоКлассификатора(Сайт, МенеджерыСайтов[Сайт], Классификатор, Дерево);
	КонецЦикла;
	
КонецПроцедуры

Функция ДоступныеДляПолученияКонтакты(Сайт, АдресРезюме) Экспорт
	
	Результат = ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме();
	
	Если МенеджерыСайтов[Сайт] <> Неопределено Тогда
		Результат =  РекрутинговыеСайтыВнутренний.ДоступныеДляПолученияКонтакты(Сайт, МенеджерыСайтов[Сайт], АдресРезюме);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КонтактыРезюме(Сайт, АдресРезюме) Экспорт
	
	Возврат РекрутинговыеСайтыВнутренний.КонтактыРезюме(Сайт, МенеджерыСайтов[Сайт], АдресРезюме);
	
КонецФункции

Функция ШаблоныСтраницСайтов() Экспорт
	
	Шаблоны = РекрутинговыеСайтыСлужебный.НовыеШаблоныСайта();
	
	Для Каждого Сайт Из Сайты Цикл
		ДанныеСайта = ДанныеСайтов[Сайт];
		Если ЗначениеЗаполнено(ДанныеСайта.ШаблоныСтраницСайта.Сайт) Тогда
			ЗаполнитьЗначенияСвойств(Шаблоны.Добавить(), ДанныеСайта.ШаблоныСтраницСайта);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Шаблоны;
	
КонецФункции

// Параметры:
//  Сайт - СправочникСсылка.ИсточникиИнформацииОКандидатах
// 
// Возвращаемое значение:
// Строка
Функция ТекстВопросаПоКонтактногоДоступа(Сайт) Экспорт
	
	Возврат ДанныеСайтов[Сайт].ТекстВопросаПоКонтактногоДоступа;
	
КонецФункции

// Параметры:
//  Сайт - СправочникСсылка.ИсточникиИнформацииОКандидатах
// 
// Возвращаемое значение:
//  Булево
Функция БольшеНеЗадаватьВопросПоКонтактногоДоступа(Сайт) Экспорт
	
	Возврат ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"ИнтеграцияРекрутинговыхСайтов", "БольшеНеЗадаватьВопросПоКонтактногоДоступа" + ДанныеСайтов[Сайт].Имя, Ложь);
	
КонецФункции

// Параметры:
//  Сайт - СправочникСсылка.ИсточникиИнформацииОКандидатах
Процедура СохранитьБольшеНеЗадаватьВопросПоКонтактногоДоступа(Сайт) Экспорт
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить(
		"ИнтеграцияРекрутинговыхСайтов", "БольшеНеЗадаватьВопросПоКонтактногоДоступа" + ДанныеСайтов[Сайт].Имя, Истина);
	
КонецПроцедуры

Функция ЭтоАдресРезюме(Адрес) Экспорт
	
	ЭтоАдресРезюме = Ложь;
	
	Для Каждого Сайт Из Сайты Цикл
		Если СтрНайти(Адрес, ДанныеСайтов[Сайт].ИмяСайта) <> 0 Тогда
			ЭтоАдресРезюме = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЭтоАдресРезюме;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяРеквизита(ДанныеСайтов, ИмяРеквизитаФормы, Сайт)

	Возврат РекрутинговыеСайтыКлиентСервер.ИмяРеквизита(ДанныеСайтов, ИмяРеквизитаФормы, Сайт);

КонецФункции

Процедура ЗаполнитьОбъединенноеДеревоРегионов(Дерево, Классификатор)
	
	ДеревьяПоКлассификаторам = ДеревьяРегионовПоКлассификаторамСайтов(Дерево, Классификатор);
	ЗаполнитьДеревоРегионовОбщее(Дерево);
	
	ВыбираемыеСтроки = Новый Массив;
	УдаляемыеСтроки = Новый Массив;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		ДополнитьВыбираемыеСтроки(ВыбираемыеСтроки, СтрокаДерева);
	КонецЦикла;
	
	Для Каждого СтрокаДерева Из ВыбираемыеСтроки Цикл
		Родитель = СтрокаДерева.Родитель;
		Если ЗначениеЗаполнено(Родитель) Тогда
			ЗначениеРодителя = Родитель.Значение;
		Иначе
			ЗначениеРодителя = "";
		КонецЕсли;
		
		Идентификаторы = ИдентификаторыЗначенияИзДеревьевПоКлассификаторам(ДеревьяПоКлассификаторам, СтрокаДерева.Значение, ЗначениеРодителя);
		
		Если Идентификаторы <> Неопределено Тогда
			СтрокаДерева.ИдентификаторДоп = ОбщегоНазначения.ФиксированныеДанные(Идентификаторы);
		Иначе
			УдаляемыеСтроки.Добавить(СтрокаДерева);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДерева Из УдаляемыеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаДерева.Родитель) Тогда
			СтрокаДерева.Родитель.Строки.Удалить(СтрокаДерева);
		Иначе
			Дерево.Строки.Удалить(СтрокаДерева);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторРезюмеПоАдресу(Сайт, АдресРезюме)
	
	Если Не ДанныеСайтов[Сайт].ДоступнаЗагрузкаКандидатов Тогда
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
			СтрШаблон(НСтр("ru = 'Загрузка резюме с %1 не поддерживается.'"), ДанныеСайтов[Сайт].Представление));
	КонецЕсли;
	
	Возврат РекрутинговыеСайтыВнутренний.ИдентификаторРезюмеПоАдресу(Сайт, МенеджерыСайтов[Сайт], АдресРезюме);;
	
КонецФункции

Функция ДеревьяРегионовПоКлассификаторамСайтов(ШаблонСтруктурыДерева, Классификатор)
	
	Деревья = Новый Соответствие;
	
	Для Каждого Сайт Из Сайты Цикл
		Дерево = ШаблонСтруктурыДерева.Скопировать();
		
		РекрутинговыеСайтыВнутренний.ЗаполнитьДеревоКлассификатора(Сайт, МенеджерыСайтов[Сайт], Классификатор, Дерево);
		
		Деревья.Вставить(Сайт, Дерево);
	КонецЦикла;
	
	Возврат Деревья;
	
КонецФункции

Процедура ЗаполнитьДеревоРегионовОбщее(Дерево)
	
	КлассификаторыОбщие = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("КлассификаторыОбщие");
	
	Если КлассификаторыОбщие = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегионыГорода = КлассификаторыОбщие.Получить("regions");
	ИдентификаторыСтрокДерева = Новый Соответствие;
	
	ТаблицаРегионыГорода = Новый ТаблицаЗначений;
	ТаблицаРегионыГорода.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаРегионыГорода.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
	
	Для Каждого КлючИЗначение Из РегионыГорода Цикл
		НоваяСтрока = ТаблицаРегионыГорода.Добавить();
		НоваяСтрока.Идентификатор = КлючИЗначение.Ключ;
		НоваяСтрока.Значение = КлючИЗначение.Значение;
	КонецЦикла;
	
	ТаблицаРегионыГорода.Сортировать("Идентификатор");
	
	ПерваяСтрока = Истина;
	Для Каждого Строка Из ТаблицаРегионыГорода Цикл
		Если ПерваяСтрока Тогда
			ПерваяСтрока = Ложь;
		Иначе
			ИдентификаторРодителя = Лев(Строка.Идентификатор, СтрНайти(Строка.Идентификатор, ".", НаправлениеПоиска.СКонца) - 1);
			СтрокаРодителя = ИдентификаторыСтрокДерева.Получить(ИдентификаторРодителя);
			
			Если СтрокаРодителя = Неопределено Тогда
				СтрокаРодителя = Дерево;
			КонецЕсли;
			
			НоваяСтрока = СтрокаРодителя.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			ИдентификаторыСтрокДерева.Вставить(НоваяСтрока.Идентификатор, НоваяСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыЗначенияИзДеревьевПоКлассификаторам(ДеревьяПоКлассификаторам, Значение, ЗначениеРодителя)
	
	Идентификаторы = Новый Структура;
	
	Для Каждого КлючИЗначение Из ДеревьяПоКлассификаторам Цикл
		Сайт = КлючИЗначение.Ключ;
		
		Дерево = ДеревьяПоКлассификаторам.Получить(Сайт);
		
		СтрокаДерева = РекрутинговыеСайтыСлужебный.СтрокаДереваПоКлассификатору(
			Дерево.Строки, Значение, ЗначениеРодителя, ДанныеСайтов[Сайт].ЗаменяемыеЗначенияКлассификатора);
		
		Если СтрокаДерева = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Идентификаторы.Вставить(ИдентификаторЗначенияКлассификатора(ДанныеСайтов[Сайт].Имя), СтрокаДерева.Идентификатор);
	КонецЦикла;
	
	Возврат Идентификаторы;
	
КонецФункции

Процедура ДополнитьВыбираемыеСтроки(ВыбираемыеСтроки, ТекущаяСтрока)
	
	Если ТекущаяСтрока.Строки.Количество() = 0 Тогда
		ВыбираемыеСтроки.Добавить(ТекущаяСтрока);
	Иначе
		Для Каждого ПодСтрока Из ТекущаяСтрока.Строки Цикл
			ДополнитьВыбираемыеСтроки(ВыбираемыеСтроки, ПодСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ИдентификаторЗначенияКлассификатора(ИмяСайта)
	
	Возврат "ID" + ИмяСайта;
	
КонецФункции

#КонецОбласти

#КонецЕсли
